# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html
   #### Nombre: Carlos Juca

In [10]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from pandas.tools.plotting import radviz

%matplotlib inline

In [17]:
mi_df = pd.DataFrame(({'a': [11,12,13], 'b': [21,22,23],'c':[12,23,43]}))
print(mi_df)

    a   b   c
0  11  21  12
1  12  22  23
2  13  23  43

In [19]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1],
        'Cantones':[16,7,6]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

      ciudad    capital  zona  Cantones
0       Loja       Loja     7        16
1  Pichincha      Quito     8         7
2     Guayas  Guayaquil     1         6

In [25]:
columnas = ['nombres','apellidos','cedula','ciudad']

In [26]:
lista = [['rene', 'elizalde', '11041260','Loja'],
        ['rolando', 'solano', '11041261','Quito'],
        ['carlos','Juca','1105137234','Guayaquil'],
        ['Juan','Santos','123454321','Machala'],
        ['Luis','Castillo','1135654','Loja']]

In [27]:
data = pd.DataFrame(lista, columns=columnas)

In [28]:
data

   nombres apellidos      cedula     ciudad
0     rene  elizalde    11041260       Loja
1  rolando    solano    11041261      Quito
2   carlos      Juca  1105137234  Guayaquil
3     Juan    Santos   123454321    Machala
4     Luis  Castillo     1135654       Loja

In [29]:
lista2 = [['rene2', 'elizalde2', '11041263','Loja'],
        ['rolando2', 'solano2', '11041264','Quito'],]

In [31]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [32]:
data2

    nombres  apellidos    cedula ciudad
0     rene2  elizalde2  11041263   Loja
1  rolando2    solano2  11041264  Quito

In [33]:
data3 = pd.concat([data, data2])

In [34]:
data3

    nombres  apellidos      cedula     ciudad
0      rene   elizalde    11041260       Loja
1   rolando     solano    11041261      Quito
2    carlos       Juca  1105137234  Guayaquil
3      Juan     Santos   123454321    Machala
4      Luis   Castillo     1135654       Loja
0     rene2  elizalde2    11041263       Loja
1  rolando2    solano2    11041264      Quito

In [35]:
columnas = ['nombre','apellido','cedula']

In [36]:
lista3=[['Carlos','Juca','1105137234'],
       ['Luis','Erazo','1102189763'],
       ['Carlos','Castillo','11762512']]

In [38]:
data = pd.DataFrame(lista3,columns=columnas)

In [39]:
data

   nombre  apellido      cedula
0  Carlos      Juca  1105137234
1    Luis     Erazo  1102189763
2  Carlos  Castillo    11762512

In [40]:
columnas = ['Ciudad','Provincia','cedula']

In [41]:
lista4= [['Loja','Loja','1105137234'],
        ['Pichicha','Quito','112342312']]

In [43]:
data2=pd.DataFrame(lista4,columns=columnas)

In [44]:
data2

     Ciudad Provincia      cedula
0      Loja      Loja  1105137234
1  Pichicha     Quito   112342312

In [ ]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [ ]:
data5

In [ ]:
result = pd.merge(data3, data5, on='cedula')

In [ ]:
result

In [ ]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6